---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LinearDimType
source: html/4f32d6b2-4620-e6c9-fd91-4e7a1b6cb9bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LinearDimType Property

"Dimension String Type"

## Syntax (C#)
```csharp
public static ForgeTypeId LinearDimType { get; }
```